{"class_name": "Functional", "config": {"name": "model", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "registered_name": null, "name": "input_1", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Embedding", "config": {"name": "embedding", "trainable": false, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 38202, "output_dim": 200, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "registered_name": null, "build_config": {"input_shape": [null, null]}, "name": "embedding", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "dtype": "float32", "layer": {"module": "Model", "class_name": "CustomGRULayer", "config": {"name": "custom_gru_layer", "trainable": true, "dtype": "float32", "units": 256, "return_sequences": true, "return_state": false, "go_backwards": false}, "registered_name": "CustomGRULayer"}, "merge_mode": "concat"}, "registered_name": null, "build_config": {"input_shape": [null, null, 200]}, "name": "bidirectional", "inbound_nodes": [[["embedding", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 512]}, "name": "dropout", "inbound_nodes": [[["bidirectional", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention", "trainable": true, "dtype": "float32", "num_heads": 2, "key_dim": 256, "value_dim": 256, "dropout": 0.0, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, null, 512], "key_shape": [null, null, 512], "value_shape": [null, null, 512]}, "registered_name": null, "build_config": {"input_shape": [null, null, 512]}, "name": "multi_head_attention", "inbound_nodes": [[["dropout", 0, 0, {"value": ["dropout", 0, 0], "key": ["dropout", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 512]}, "name": "dropout_1", "inbound_nodes": [[["multi_head_attention", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "dtype": "float32", "layer": {"module": "Model", "class_name": "CustomGRULayer", "config": {"name": "custom_gru_layer_1", "trainable": true, "dtype": "float32", "units": 256, "return_sequences": true, "return_state": false, "go_backwards": false}, "registered_name": "CustomGRULayer"}, "merge_mode": "concat"}, "registered_name": null, "build_config": {"input_shape": [null, null, 512]}, "name": "bidirectional_1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 512]}, "name": "dropout_2", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "TimeDistributed", "config": {"name": "time_distributed", "trainable": true, "dtype": "float32", "layer": {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [null, null, 512]}, "name": "time_distributed", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["time_distributed", 0, 0]]}, "keras_version": "2.15.0", "backend": "tensorflow"}